export default function Google() {
  return (
    <svg
      id="search_2_"
      data-name="search (2)"
      xmlns="http://www.w3.org/2000/svg"
      width="42"
      height="42"
      viewBox="0 0 42 42"
    >
      <path
        id="Контур_2128"
        data-name="Контур 2128"
        d="M9.308,152.307l-1.462,5.458-5.343.113a21.037,21.037,0,0,1-.155-19.61h0l4.757.872,2.084,4.729a12.533,12.533,0,0,0,.118,8.438Z"
        transform="translate(0 -126.926)"
        fill="#fbbb00"
      />
      <path
        id="Контур_2129"
        data-name="Контур 2129"
        d="M281.8,208.176a20.992,20.992,0,0,1-7.486,20.3h0l-5.992-.306-.848-5.294a12.516,12.516,0,0,0,5.385-6.391H261.628v-8.308H281.8Z"
        transform="translate(-240.166 -191.099)"
        fill="#518ef8"
      />
      <path
        id="Контур_2130"
        data-name="Контур 2130"
        d="M62.152,321.4h0a21.007,21.007,0,0,1-31.644-6.425l6.805-5.571a12.489,12.489,0,0,0,18,6.395Z"
        transform="translate(-28.006 -284.028)"
        fill="#28b446"
      />
      <path
        id="Контур_2131"
        data-name="Контур 2131"
        d="M60.68,4.835l-6.8,5.57a12.488,12.488,0,0,0-18.411,6.539l-6.841-5.6h0A21,21,0,0,1,60.68,4.835Z"
        transform="translate(-26.276)"
        fill="#f14336"
      />
    </svg>
  );
}
